runs/codex_openfoam_smoke_run/openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.120000 -0.120000 -0.120000)   // 0
    ( 0.120000 -0.120000 -0.120000)   // 1
    ( 0.120000  0.120000 -0.120000)   // 2
    (-0.120000  0.120000 -0.120000)   // 3
    (-0.120000 -0.120000 0.300000)   // 4
    ( 0.120000 -0.120000 0.300000)   // 5
    ( 0.120000  0.120000 0.300000)   // 6
    (-0.120000  0.120000 0.300000)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 12 21) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

// ************************************************************************* //
