runs/codex_openfoam_smoke_run/openfoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 9.375000e-02;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0500;
        value           uniform 9.375000e-02;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            slip;
    }

    "(hub|duct|hub_wall|duct_wall|rotor.*|stator.*)"
    {
        type            kqRWallFunction;
        value           uniform 9.375000e-02;
    }
}

// ************************************************************************* //
